{
  "backend/main.mo": "Motoko backend handling user profiles, product management with admin authorization, and Stripe configuration with permission checks and traps for unauthorized access.",
  "feature_evidence.json": "Report mapping features to related files, components, tests, and confidence levels for deployment, Stripe readiness, and error‑handling improvements.",
  "frontend-file-summaries.txt": "Index of concise frontend component descriptions generated for build planning and documentation.",
  "frontend/index.css": "Global Tailwind-based OKLCH color theme defining light and dark mode variables and base styling.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx with Internet Identity and subscription feature title.",
  "frontend/OPS-NOTE-release-deploy.md": "Operations note documenting root causes of a deployment failure and detailing fixes such as error handling, Stripe checks, and new payment routes.",
  "frontend/src/App.tsx": "Main React component managing authentication, simple routing for payment pages, profile setup gating, and rendering the upgrade flow.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright info and Caffeine.ai attribution with dynamic referral tracking.",
  "frontend/src/components/Header.tsx": "App header providing login/logout controls, user greeting, and toast‑based error handling for authentication issues.",
  "frontend/src/components/PaymentFailure.tsx": "Shows a payment cancelled message with retry navigation and support info.",
  "frontend/src/components/PaymentSuccess.tsx": "Displays a successful payment confirmation and a button to return to the app.",
  "frontend/src/components/ProfileSetup.tsx": "Collects and saves the user's name with error handling and loading states.",
  "frontend/src/components/StripeUpiChecklistDialog.tsx": "Provides a dialog containing a step‑by‑step guide for enabling UPI in Stripe.",
  "frontend/src/components/UpgradePro.tsx": "Handles Pro plan upgrades, Stripe checkout initiation, and related authentication and config checks.",
  "frontend/src/components/UpiHelpSection.tsx": "Explains how UPI works in Stripe Checkout and warns against direct payments.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth handling, providing login, logout, and identity state via context.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profile retrieval/saving, Stripe configuration checks, and creating Stripe checkout sessions via the actor API.",
  "frontend/src/index.css": "Defines global Tailwind layers and CSS variables for light/dark themes and shared styling tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/userFacingError.ts": "Maps technical errors to friendly user messages for common cases like Stripe issues, JSON parsing, and auth failures.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Stores project metadata including versioning, feature summaries, architecture notes, and known issues."
}